repro/runs/run_cht/cfd/rccs2d/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     buoyantSimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5900;

deltaT          1;

writeControl    timeStep;

writeInterval   150;

purgeWrite      4;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    wallT
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        writeControl    timeStep;
        writeInterval   100;
        writeFields     false;
        regionType      patch;
        operation       areaAverage;
        fields          ( T );
        name            plate;
        log             true;
    }
    wallTriser
    {
        type            surfaceFieldValue;
        libs            ( fieldFunctionObjects );
        writeControl    timeStep;
        writeInterval   100;
        writeFields     false;
        regionType      patch;
        operation       areaAverage;
        fields          ( T );
        name            riser;
        log             true;
    }
}


// ************************************************************************* //
