repro/runs/run_cht/cfd/rccs2d/0.orig/p
FoamFile { version 2.0; format ascii; class volScalarField; object p; }
dimensions [1 -1 -2 0 0 0 0];
internalField uniform 1e5;
boundaryField
{
    plate
    {
        type calculated;
        value $internalField;
    }
    riser
    {
        type calculated;
        value $internalField;
    }
    topAndBottom
    {
        type calculated;
        value $internalField;
    }
    frontAndBack
    {
        type empty;
    }
}
