repro/runs/run_cht/cfd/rccs2d/0.orig/IDefault
FoamFile { version 2.0; format ascii; class volScalarField; object IDefault; }
dimensions [1 0 -3 0 0 0 0];
internalField uniform 0;
boundaryField
{
    plate
    {
        type greyDiffusiveRadiation;
        value uniform 0;
    }
    riser
    {
        type greyDiffusiveRadiation;
        value uniform 0;
    }
    topAndBottom
    {
        type greyDiffusiveRadiation;
        value uniform 0;
    }
    frontAndBack
    {
        type empty;
    }
}
