repro/runs/run_cht/cfd/rccs2d/0.orig/T
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 320;
boundaryField
{
    plate
    {
        type externalWallHeatFluxTemperature;
        mode flux;
        q uniform 5501;
        qr qr;
        qrRelaxation 0.2;
        kappaMethod fluidThermo;
        value uniform 600;
    }
    riser
    {
        type externalWallHeatFluxTemperature;
        mode coefficient;
        h uniform 82.3;
        Ta uniform 341.85;
        qr qr;
        qrRelaxation 0.2;
        kappaMethod fluidThermo;
        value uniform 400;
    }
    topAndBottom
    {
        type zeroGradient;
    }
    frontAndBack
    {
        type empty;
    }
}
