repro/runs/run_cht/cfd/rccs2d/0.orig/T.stage1
FoamFile { version 2.0; format ascii; class volScalarField; object T; }
dimensions [0 0 0 1 0 0 0];
internalField uniform 450;
boundaryField
{
    plate        { type fixedValue; value uniform 645; }
    riser        { type fixedValue; value uniform 405; }
    topAndBottom { type zeroGradient; }
    frontAndBack { type empty; }
}
