repro/runs/run_cht/cfd/rccs2d/0.orig/k
FoamFile { version 2.0; format ascii; class volScalarField; object k; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 3.75e-4;
boundaryField
{
    plate
    {
        type kqRWallFunction;
        value uniform 3.75e-4;
    }
    riser
    {
        type kqRWallFunction;
        value uniform 3.75e-4;
    }
    topAndBottom
    {
        type kqRWallFunction;
        value uniform 3.75e-4;
    }
    frontAndBack
    {
        type empty;
    }
}
