repro/runs/run_cht/cfd/rccs2d/0.orig/nut
FoamFile { version 2.0; format ascii; class volScalarField; object nut; }
dimensions [0 2 -1 0 0 0 0];
internalField uniform 0;
boundaryField
{
    plate
    {
        type nutUWallFunction;
        value uniform 0;
    }
    riser
    {
        type nutUWallFunction;
        value uniform 0;
    }
    topAndBottom
    {
        type nutUWallFunction;
        value uniform 0;
    }
    frontAndBack
    {
        type empty;
    }
}
