repro/runs/run_cht/cfd/rccs2d/0.orig/omega
FoamFile { version 2.0; format ascii; class volScalarField; object omega; }
dimensions [0 0 -1 0 0 0 0];
internalField uniform 0.12;
boundaryField
{
    plate
    {
        type omegaWallFunction;
        value uniform 0.12;
    }
    riser
    {
        type omegaWallFunction;
        value uniform 0.12;
    }
    topAndBottom
    {
        type omegaWallFunction;
        value uniform 0.12;
    }
    frontAndBack
    {
        type empty;
    }
}
